#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_lxc.basic will be created
  + resource "proxmox_lxc" "basic" {
      + arch         = "amd64"
      + clone        = "10001"
      + cmode        = "tty"
      + console      = true
      + cpulimit     = 0
      + cpuunits     = 1024
      + hostname     = "lxc-clone"
      + id           = (known after apply)
      + memory       = 512
      + onboot       = false
      + ostype       = (known after apply)
      + protection   = false
      + start        = false
      + swap         = 0
      + tags         = (known after apply)
      + target_node  = "milky-capella"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Walkmana-25, Action: `pull_request`*